Lingjia007/STM32F407_Bootloader/IAP/menu.c
/**
 ******************************************************************************
 * @file    IAP/IAP_Main/Src/menu.c
 * @author  MCD Application Team
 * @brief   This file provides the software which contains the main menu routine.
 ******************************************************************************
 */

#include "main.h"
#include "service_menu.h"
#include "platform_config.h"
#include "platform_filesystem_fatfs_impl.h"
#include "platform_filesystem_lfs_impl.h"
#include "menu.h"
#include "ymodem.h"
#include "fatfs.h"
#include "service_lfs_spi_flash_adapter.h"
#include "bootloader_core.h"
#include "lfs.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "ctype.h"
#include "service_aes_decrypt.h"
#include "service_hpatch.h"
#include "usart.h"
#include "esp8266_ota_api.h"
#include "esp8266_ota_config.h"
#include "service_wifi_transport.h"
#include "service_onenet_ota.h"
#include "service_ed25519_verify.h"
#include "edsign.h"

#define MAX_FILES 20
#define MAX_FILENAME_LEN 128
#define RX_TIMEOUT ((uint32_t)0xFFFFFFFF)
#define USER_FLASH_SIZE (g_internal_flash.flash_base.total_size)

static menu_ctx_t g_menu_ctx;

static fs_fatfs_t g_fs_fatfs;
static fs_lfs_t g_fs_lfs;

uint32_t FlashProtection = 0;
uint8_t aFileName[FILE_NAME_LENGTH];

static char file_list[MAX_FILES][MAX_FILENAME_LEN];
static uint8_t file_count = 0;

static char hdiff_list[MAX_FILES][MAX_FILENAME_LEN];
static uint8_t hdiff_count = 0;

static uint8_t check_file_extension(const char *filename)
{
  const char *ext = NULL;
  size_t len = strlen(filename);

  if (len < 4)
    return 0;

  ext = filename + len - 4;
  if (strcmp(ext, ".bin") == 0 || strcmp(ext, ".BIN") == 0)
    return 1;

  if (len >= 6)
  {
    ext = filename + len - 6;
    if (strcmp(ext, ".hdiff") == 0 || strcmp(ext, ".HDIFF") == 0)
      return 2;
  }

  if (len >= 8)
  {
    ext = filename + len - 8;
    if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      return 1;
  }

  return 0;
}

static void scan_sd_card_files(void)
{
  DIR dir;
  FILINFO fno;
  FRESULT res;

  file_count = 0;
  res = f_opendir(&dir, "0:/");
  if (res != FR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot open SD card directory!");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = f_readdir(&dir, &fno);
    if (res != FR_OK || fno.fname[0] == 0)
      break;
    if (!(fno.fattrib & AM_DIR))
    {
      if (check_file_extension(fno.fname))
      {
        strncpy(file_list[file_count], fno.fname, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }
  f_closedir(&dir);
}

static void scan_lfs_files(lfs_t *lfs)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;

  file_count = 0;
  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot open SPI Flash directory!");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
      break;
    if (info.type == LFS_TYPE_REG)
    {
      if (check_file_extension(info.name))
      {
        strncpy(file_list[file_count], info.name, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }
  lfs_dir_close(lfs, &dir);
}

static void scan_fs_hdiff_files(platform_fs_base_t *fs, const char *dir_path)
{
  platform_fs_dir_t dir;
  char name[MAX_FILENAME_LEN];
  uint32_t size;
  uint8_t is_dir;
  int16_t res;

  hdiff_count = 0;
  res = FS_DIR_OPEN(fs, &dir, dir_path);
  if (res != (int16_t)FS_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot open directory!");
    return;
  }

  while (hdiff_count < MAX_FILES)
  {
    res = FS_DIR_READ(fs, &dir, name, &size, &is_dir);
    if (res != (int16_t)FS_STATUS_OK)
      break;
    if (!is_dir)
    {
      size_t len = strlen(name);
      if (len >= 6)
      {
        const char *ext = name + len - 6;
        if (strcmp(ext, ".hdiff") == 0 || strcmp(ext, ".HDIFF") == 0)
        {
          strncpy(hdiff_list[hdiff_count], name, MAX_FILENAME_LEN - 1);
          hdiff_list[hdiff_count][MAX_FILENAME_LEN - 1] = '\0';
          hdiff_count++;
        }
      }
    }
  }
  FS_DIR_CLOSE(fs, &dir);
}

static void scan_fs_files_filter(platform_fs_base_t *fs, const char *dir_path, uint8_t filter_type)
{
  platform_fs_dir_t dir;
  char name[MAX_FILENAME_LEN];
  uint32_t size;
  uint8_t is_dir;
  int16_t res;

  file_count = 0;
  res = FS_DIR_OPEN(fs, &dir, dir_path);
  if (res != (int16_t)FS_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot open directory!");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = FS_DIR_READ(fs, &dir, name, &size, &is_dir);
    if (res != (int16_t)FS_STATUS_OK)
      break;
    if (!is_dir)
    {
      uint8_t ext_type = check_file_extension(name);
      if (ext_type == filter_type || (filter_type == 0 && ext_type))
      {
        strncpy(file_list[file_count], name, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }
  FS_DIR_CLOSE(fs, &dir);
}

static void cmd_serial_download(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t number[11] = {0};
  uint32_t size = 0;
  COM_StatusTypeDef result;

  menu_service_println(ctx, "Waiting for the file to be sent ... (press 'a' to abort)");
  result = Ymodem_Receive(&size);
  if (result == COM_OK)
  {
    HAL_Delay(100);
    menu_service_println(ctx, "\n\nProgramming Completed Successfully!");
    menu_service_println(ctx, "--------------------------------");
    menu_service_printf(ctx, "Name: %s\n", (const char *)aFileName);
    menu_service_int2str(number, size);
    menu_service_printf(ctx, "Size: %s Bytes\n", (const char *)number);
    menu_service_println(ctx, "-------------------");
  }
  else if (result == COM_LIMIT)
  {
    menu_service_println(ctx, "\n\nThe image size is higher than the allowed space memory!");
  }
  else if (result == COM_DATA)
  {
    menu_service_println(ctx, "\n\nVerification failed!");
  }
  else if (result == COM_ABORT)
  {
    menu_service_println(ctx, "\n\nAborted by user.");
  }
  else
  {
    menu_service_println(ctx, "\nFailed to receive the file!");
  }
}

static void cmd_sdcard_download(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  FRESULT res;
  bootloader_err_t err;

  menu_service_println(ctx, "Initializing TF card...");

