Lingjia007/STM32F407_Bootloader/IAP/menu.c
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for bin and aes files...\r");
  scan_sd_card_files();

  if (file_count == 0)
  {
    menu_service_println(ctx, "No bin or aes files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(ctx, "Found bin and aes files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s", i + 1, file_list[i]);
    menu_service_println(ctx, msg);
  }

  menu_service_printf(ctx, "\r\nSelect file (1-%d) or 'a' to abort: ", file_count);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'a' || key == 'A')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= file_count)
        break;
    }
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s", file_list[selected - 1]);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Starting firmware update...");

  g_fatfs_transport.fs = &SDFatFS;
  strncpy(bootloader_ctx.config.storage.fatfs_path, file_list[selected - 1], sizeof(bootloader_ctx.config.storage.fatfs_path) - 1);
  bootloader_ctx.config.storage.fatfs_path[sizeof(bootloader_ctx.config.storage.fatfs_path) - 1] = '\0';
  bootloader_ctx.config.storage.internal_flash_addr = APPLICATION_ADDRESS;

  err = bootloader_download(&g_fatfs_transport.base, &g_internal_flash.transport_base, bootloader_ctx.config.storage.fatfs_path);

  if (err == BOOTLOADER_OK)
  {
    menu_service_println(ctx, "Firmware update completed successfully!");
    menu_service_println(ctx, "You can now execute the application.");
  }
  else
  {
    menu_service_print(ctx, "Firmware update failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-err));
    menu_service_println(ctx, msg);
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_spi_flash_download(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  int res;
  bootloader_err_t err;
  lfs_t lfs;

  menu_service_println(ctx, "Initializing SPI Flash...");

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_print(ctx, "Error: LittleFS mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-res));
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for bin and aes files...\r");
  scan_lfs_files(&lfs);

  if (file_count == 0)
  {
    menu_service_println(ctx, "No bin or aes files found on SPI Flash!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  menu_service_println(ctx, "Found bin and aes files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s", i + 1, file_list[i]);
    menu_service_println(ctx, msg);
  }

  menu_service_printf(ctx, "\r\nSelect file (1-%d) or 'a' to abort: ", file_count);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'a' || key == 'A')
    {
      menu_service_println(ctx, "\rAborted by user.");
      lfs_spi_flash_unmount(&lfs);
      return;
    }
    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= file_count)
        break;
    }
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s", file_list[selected - 1]);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Starting firmware update...");

  g_lfs_transport.lfs = &lfs;
  strncpy(bootloader_ctx.config.storage.lfs_path, file_list[selected - 1], sizeof(bootloader_ctx.config.storage.lfs_path) - 1);
  bootloader_ctx.config.storage.lfs_path[sizeof(bootloader_ctx.config.storage.lfs_path) - 1] = '\0';
  bootloader_ctx.config.storage.internal_flash_addr = APPLICATION_ADDRESS;

  err = bootloader_download(&g_lfs_transport.base, &g_internal_flash.transport_base, bootloader_ctx.config.storage.lfs_path);

  if (err == BOOTLOADER_OK)
  {
    menu_service_println(ctx, "Firmware update completed successfully!");
    menu_service_println(ctx, "You can now execute the application.");
  }
  else
  {
    menu_service_print(ctx, "Firmware update failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-err));
    menu_service_println(ctx, msg);
  }

  lfs_spi_flash_unmount(&lfs);
}

static void cmd_serial_upload(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t status = 0;

  menu_service_println(ctx, "\n\nSelect Receive File\n");
  menu_service_getchar(ctx, &status, RX_TIMEOUT);
  if (status == CRC16)
  {
    status = Ymodem_Transmit((uint8_t *)APPLICATION_ADDRESS, (const uint8_t *)"UploadedFlashImage.bin", USER_FLASH_SIZE);
    if (status != 0)
    {
      menu_service_println(ctx, "\nError Occurred while Transmitting File\n");
    }
    else
    {
      menu_service_println(ctx, "\nFile uploaded successfully \n");
    }
  }
}

static void cmd_execute_app(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Start program execution......\n");
  bootloader_ctx.config.jump.jump_func(bootloader_ctx.config.jump.app_jump_addr);
}

static void cmd_flash_protection(menu_ctx_t *ctx, int argc, char *argv[])
{
  FlashProtection = INTERNAL_FLASH_GET_PROTECTION_STATUS(&g_internal_flash.flash_base);

  if (FlashProtection != INTERNAL_FLASH_PROTECTION_NONE)
  {
    if (INTERNAL_FLASH_SET_PROTECTION(&g_internal_flash.flash_base, 0, 0) == INTERNAL_FLASH_STATUS_OK)
    {
      menu_service_println(ctx, "Write Protection disabled...");
      menu_service_println(ctx, "System will now restart...");
      HAL_FLASH_OB_Launch();
      HAL_FLASH_Unlock();
    }
    else
    {
      menu_service_println(ctx, "Error: Flash write un-protection failed...");
    }
  }
  else
  {
    if (INTERNAL_FLASH_SET_PROTECTION(&g_internal_flash.flash_base,
                                      OB_WRP_SECTOR_5 | OB_WRP_SECTOR_6 | OB_WRP_SECTOR_7 |
                                          OB_WRP_SECTOR_8 | OB_WRP_SECTOR_9 | OB_WRP_SECTOR_10 | OB_WRP_SECTOR_11,
                                      1) == INTERNAL_FLASH_STATUS_OK)
    {
      menu_service_println(ctx, "Write Protection enabled...");
      menu_service_println(ctx, "System will now restart...");
      HAL_FLASH_OB_Launch();
    }
    else
    {
      menu_service_println(ctx, "Error: Flash write protection failed...");
    }
  }
}

