Lingjia007/STM32F407_Bootloader/IAP/menu.c
static void cmd_uart_passthrough(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t rx_data;
  uint8_t q_count = 0;
  uint32_t q_timer = 0;
  platform_uart_base_t *uart4 = &g_uart4_console.base;
  platform_uart_base_t *usart1 = &g_usart1_esp8266.base;

  menu_service_println(ctx, "\r\n========== UART4 <-> USART1 Passthrough Mode ==========");
  menu_service_println(ctx, "  UART4 (PA0/PA1) <--> USART1 (PA9/PA10)");
  menu_service_println(ctx, "  Baud Rate: 115200, 8N1");
  menu_service_println(ctx, "  For ESP8266/BLE AT Command Debug");
  menu_service_println(ctx, "  Press 'q' 3 times within 1 second to exit");
  menu_service_println(ctx, "========================================================\n");

  UART_ABORT(usart1);
  UART_DISABLE_IT(usart1, PLATFORM_UART_IT_RXNE);
  UART_DISABLE_IT(usart1, PLATFORM_UART_IT_IDLE);
  UART_FLUSH(uart4);
  UART_FLUSH(usart1);
  UART_CLEAR_FLAG(uart4, PLATFORM_UART_FLAG_ORE);
  UART_CLEAR_FLAG(usart1, PLATFORM_UART_FLAG_ORE);

  while (1)
  {
    if (UART_GET_FLAG(uart4, PLATFORM_UART_FLAG_RXNE))
    {
      rx_data = UART_READ_BYTE(uart4);
      if (rx_data == 'q')
      {
        if (q_count == 0 || (HAL_GetTick() - q_timer) < 1000)
        {
          q_count++;
          q_timer = HAL_GetTick();
          if (q_count >= 3)
          {
            menu_service_println(ctx, "\n\nExiting passthrough mode...");
            UART_ENABLE_IT(usart1, PLATFORM_UART_IT_RXNE);
            UART_ENABLE_IT(usart1, PLATFORM_UART_IT_IDLE);
            return;
          }
        }
        else
        {
          q_count = 1;
          q_timer = HAL_GetTick();
        }
        while (!UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_TXE))
          ;
        UART_WRITE_BYTE(usart1, rx_data);
      }
      else
      {
        q_count = 0;
        while (!UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_TXE))
          ;
        UART_WRITE_BYTE(usart1, rx_data);
      }
    }
    else if (UART_GET_FLAG(uart4, PLATFORM_UART_FLAG_ORE))
    {
      UART_CLEAR_FLAG(uart4, PLATFORM_UART_FLAG_ORE);
    }

    if (UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_RXNE))
    {
      rx_data = UART_READ_BYTE(usart1);
      while (!UART_GET_FLAG(uart4, PLATFORM_UART_FLAG_TXE))
        ;
      UART_WRITE_BYTE(uart4, rx_data);
    }
    else if (UART_GET_FLAG(usart1, PLATFORM_UART_FLAG_ORE))
    {
      UART_CLEAR_FLAG(usart1, PLATFORM_UART_FLAG_ORE);
    }
  }
}

static void ShowStoredImages(lfs_t *lfs)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;
  uint8_t count = 0;
  char msg[128];

  menu_service_println(&g_menu_ctx, "Stored images in SPI Flash:");
  menu_service_println(&g_menu_ctx, "========================================");

  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot open directory!");
    return;
  }

  while (1)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
      break;
    if (info.type == LFS_TYPE_REG)
    {
      count++;
      snprintf(msg, sizeof(msg), "  [%d] %s  Size: %u bytes", count, info.name, (unsigned int)info.size);
      menu_service_println(&g_menu_ctx, msg);
    }
  }
  lfs_dir_close(lfs, &dir);

  if (count == 0)
    menu_service_println(&g_menu_ctx, "  No images stored.");
  menu_service_println(&g_menu_ctx, "========================================");
}

static void DeleteStoredImage(lfs_t *lfs)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  int res;

  scan_lfs_files(lfs);
  if (file_count == 0)
  {
    menu_service_println(&g_menu_ctx, "No images found to delete!");
    return;
  }

  menu_service_println(&g_menu_ctx, "Select image to delete:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s", i + 1, file_list[i]);
    menu_service_println(&g_menu_ctx, msg);
  }

  menu_service_printf(&g_menu_ctx, "\r\nEnter selection (1-%d) or 'a' to abort: ", file_count);
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == 'a' || key == 'A')
    {
      menu_service_println(&g_menu_ctx, "\rAborted by user.");
      return;
    }
    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= file_count)
        break;
    }
  }

  snprintf(msg, sizeof(msg), "\rDeleting: %s", file_list[selected - 1]);
  menu_service_println(&g_menu_ctx, msg);

  res = lfs_remove(lfs, file_list[selected - 1]);
  if (res == LFS_ERR_OK)
    menu_service_println(&g_menu_ctx, "Image deleted successfully!");
  else
    menu_service_println(&g_menu_ctx, "Error: Failed to delete image!");
}

static void DeleteEntireFS(lfs_t *lfs)
{
  uint8_t key = 0;
  int res;

  menu_service_println(&g_menu_ctx, "WARNING: This will delete ALL files in SPI Flash!");
  menu_service_print(&g_menu_ctx, "Press 'y' to confirm, any other key to abort: ");
  menu_service_flush(&g_menu_ctx);
  menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);

  if (key != 'y' && key != 'Y')
  {
    menu_service_println(&g_menu_ctx, "\rAborted by user.");
    return;
  }

  menu_service_println(&g_menu_ctx, "\rFormatting SPI Flash file system...");

  res = lfs_unmount(lfs);
  if (res != LFS_ERR_OK)
    menu_service_println(&g_menu_ctx, "Warning: Unmount failed, continuing...");

  res = lfs_format(lfs, &lfs_spi_flash_cfg);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Format failed!");
    return;
  }

  res = lfs_mount(lfs, &lfs_spi_flash_cfg);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Remount failed!");
    return;
  }

  menu_service_println(&g_menu_ctx, "File system formatted successfully!");
}

static void StoreFromTFCard(void)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  int res;
  bootloader_err_t err;
  lfs_t lfs;

  menu_service_println(&g_menu_ctx, "Initializing TF card...");

  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(&g_menu_ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(&g_menu_ctx, msg);
    return;
  }

  menu_service_println(&g_menu_ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(&g_menu_ctx, "Error: SPI Flash initialization failed!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

